---
title: ExportUtils
classe: Autodesk.Revit.DB.ExportUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ExportUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Guid GetExportId(Subelement)` | `ExportUtils.GetExportId(subelement)` | Guid |
| `Guid GetExportId(Document, ElementId)` | `ExportUtils.GetExportId(document, elementId)` | Guid |
| `Guid GetGBXMLDocumentId(Document)` | `ExportUtils.GetGBXMLDocumentId(document)` | Guid |
| `NurbsSurfaceData GetNurbsSurfaceDataForSurface(Surface)` | `ExportUtils.GetNurbsSurfaceDataForSurface(surface)` | NurbsSurfaceData |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```